Documents/РаспределениеПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РаспределениеПлатежей</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеВБанк</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВБанк</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРаспределяемыхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРаспределяемая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвансПоСделке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаписейРегистровНакопления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзБанка</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСПоставщиком</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзБанка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВБанк</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаУслугиМатериалы</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СвязьДокументовВРасчетахСКонтрагентами</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финансовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВозвратТоваровОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВозвратТоваровОтПокупателя</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВозвратТоваровОтПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредъявленСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоСчетФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументыПолучены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеализацияТовара</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяТовародвижения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиТовародвижения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РаспределениеПлатежей/Forms/ФормаДокумента/Ext/Form/Module.bsl
//+++АК LAGP 2018.06.26 ИП-00018465.04 Создание объекта. 
//Документ предназначен для "гашения" регистра накопления "Расчёты с контрагентами" по измерению "Сделка" со значениями документов ВозвратОтПокупателя, ПоступлениеВБанк, РеализацияТоваровИУслуг. 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивПраваРедактированиеРегистраПривязкаСтороннихМагазиновКДоговорам = УправлениеДопПравамиПользователей.ПрочитатьЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РедактированиеРегистраПривязкаСтороннихМагазиновКДоговорам,Ложь,ПараметрыСеанса.ТекущийПользователь);	
	ПравоПривязкаСтороннихМагазиновКДоговорам = МассивПраваРедактированиеРегистраПривязкаСтороннихМагазиновКДоговорам[0];
	
	Если НЕ ПравоПривязкаСтороннихМагазиновКДоговорам Тогда
		Сообщить("У вас нет дополнительного права ""Редактирование регистра ""Привязка сторонних магазинов к договорам""""");
		Отказ = Истина;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьИтогРТУ();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(,Элемент,);
	ФормаВыбора.ПараметрОтборПоВладельцу = Объект.Контрагент;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
	
	ФормаВыбора.СправочникСписок.Отбор.ВидДоговора.Значение                            = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	ФормаВыбора.СправочникСписок.Отбор.ВидДоговора.Использование                       = Истина;
	ФормаВыбора.СправочникСписок.Отбор.ВидДоговора.ВидСравнения                        = ВидСравнения.Равно;

	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	ТаблицаНакладныхЭксель.Очистить();
	ЗаполнитьТЧНаСервере();
	ЗаполнитьИтогРТУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзЭкселя(Команда)
	
	ТаблицаНакладныхЭксель.Очистить();
	
	ОткрытьФормуМодально("Документ.РаспределениеПлатежей.Форма.ФормаЗагрузкиЭксель", , ЭтаФорма);
	
	Если ТаблицаНакладныхЭксель.Количество() > 0 Тогда	
		ЗаполнитьТЧНаСервере();	
			                   
		ЗаполнитьИтогРТУ();
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;	

КонецПроцедуры

Процедура ЗаполнитьТЧНаСервере() Экспорт
		
	Объект.ТаблицаРаспределяемыхДокументов.Очистить();
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСКонтрагентамиОстатки.Сделка,
		|	РасчетыСКонтрагентамиОстатки.СуммаОстаток,
		|	РасчетыСКонтрагентамиОстатки.Сделка.Дата КАК СделкаДата,
		|	РасчетыСКонтрагентамиОстатки.Сделка.НомерИсходящегоДокумента КАК НомерИсходящегоДокумента
		|ИЗ
		|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(
		|			&ДатаОстатка,
		|			(Сделка ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ИЛИ Сделка ССЫЛКА Документ.ВозвратТоваровОтПокупателя
		|				ИЛИ Сделка ССЫЛКА Документ.ПоступлениеВБанк)
		|				И Контрагент = &Контрагент
		|				И Организация = &Организация
		|				И Сделка.ДоговорКонтрагента = &ДоговорКонтрагента) КАК РасчетыСКонтрагентамиОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	СделкаДата";
	
	Запрос.УстановитьПараметр("ДатаОстатка",	 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПлатежныйДокумент, "Дата"));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", 		Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	
	Если ЗначениеЗаполнено(ТаблицаНакладныхЭксель) Тогда
		Сообщить("Поиск по номерам накладных из файла EXCEL.");
		ТаблицаИзЭкселя = ТаблицаНакладныхЭксель.Выгрузить();
		ТаблицаИзЭкселя.Свернуть("НомерНакладной", "СуммаНакладной");
		МассивНомеровНакладных = ТаблицаИзЭкселя.ВыгрузитьКолонку("НомерНакладной");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"				И Сделка.ДоговорКонтрагента = &ДоговорКонтрагента", 
		"				И Сделка.ДоговорКонтрагента = &ДоговорКонтрагента" + Символы.ПС + "				И Сделка.НомерИсходящегоДокумента В (&НомераНакладных)");
		Запрос.УстановитьПараметр("НомераНакладных", МассивНомеровНакладных);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ЗначениеЗаполнено(ТаблицаНакладныхЭксель) Тогда
		Сообщить("Найдено " + ВыборкаДетальныеЗаписи.Количество() + " элементов!");	
	КонецЕсли;	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		НоваяСтрока = Объект.ТаблицаРаспределяемыхДокументов.Добавить();	
		НоваяСтрока.Сделка 			= ВыборкаДетальныеЗаписи.Сделка;
		НоваяСтрока.СуммаОстаток 	= ?(ВыборкаДетальныеЗаписи.СуммаОстаток < 0, -ВыборкаДетальныеЗаписи.СуммаОстаток, ВыборкаДетальныеЗаписи.СуммаОстаток);
		НоваяСтрока.ВидДокумента 	= ТипЗнч(ВыборкаДетальныеЗаписи.Сделка);
		
		Если ЗначениеЗаполнено(ТаблицаНакладныхЭксель) Тогда
			НайденнаяСтрокаЭксель = ТаблицаИзЭкселя.Найти(ВыборкаДетальныеЗаписи.НомерИсходящегоДокумента, "НомерНакладной");
			Если НЕ НайденнаяСтрокаЭксель = Неопределено Тогда
				Если НайденнаяСтрокаЭксель.СуммаНакладной > ВыборкаДетальныеЗаписи.СуммаОстаток Тогда
					Сообщить("Для накладной " + ВыборкаДетальныеЗаписи.НомерИсходящегоДокумента + " вносимая сумма в EXCEL больше суммы остатка по регистру. Установлена сумма вносимая по остатку в регистре.");
					НоваяСтрока.СуммаРаспределяемая = ВыборкаДетальныеЗаписи.СуммаОстаток;
				ИначеЕсли НайденнаяСтрокаЭксель.СуммаНакладной = ВыборкаДетальныеЗаписи.СуммаОстаток Тогда
					НоваяСтрока.СуммаРаспределяемая = ВыборкаДетальныеЗаписи.СуммаОстаток;
				Иначе
					Сообщить("Для накладной " + ВыборкаДетальныеЗаписи.НомерИсходящегоДокумента + " вносимая сумма в EXCEL меньше суммы остатка по регистру.");
					НоваяСтрока.СуммаРаспределяемая = НайденнаяСтрокаЭксель.СуммаНакладной;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИтогРТУ()
	
	СуммаРеализаций = ПолучитьСуммуТаблицыНаСервере("Реализация товаров и услуг");
	СуммаВозвратов 	= ПолучитьСуммуТаблицыНаСервере("Возврат товаров от покупателя");
	
	Если СуммаРеализаций > 0 Тогда
		Элементы.НадписьСуммаРеализаций.Заголовок = "Сумма реализаций: " + СуммаРеализаций;
	Иначе
		Элементы.НадписьСуммаРеализаций.Заголовок = "";
	КонецЕсли;	
	
	Если СуммаВозвратов > 0 Тогда
		Элементы.НадписьСуммаВозвратов.Заголовок = "Сумма возвратов: " + СуммаВозвратов;
	Иначе
		Элементы.НадписьСуммаВозвратов.Заголовок = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПлатежныйДокумент) Тогда
		ОстатокПлатёжногоДокумента = Документы.РаспределениеПлатежей.ПолучитьОстатокПлатёжногоДокумента(Объект.ПлатежныйДокумент, Новый Граница(Объект.ПлатежныйДокумент.МоментВремени(), ВидГраницы.Исключая), Объект.Ссылка);	//+++АК LAGP 2018.07.06 ИП-00019118.02 Проверяются остатки не включая движения документа	
		
		Элементы.СуммаПлатежногоДокумента.Заголовок = "Остаток по ПД: " + ОстатокПлатёжногоДокумента + ". ";
		
		СуммаВносимых = 0;
		Для каждого СтрокаТаблицыРаспределяемыхДокументов из Объект.ТаблицаРаспределяемыхДокументов Цикл		
			СуммаВносимых = СуммаВносимых + ?(ТипЗнч(СтрокаТаблицыРаспределяемыхДокументов.Сделка) = Тип("ДокументСсылка.РеализацияТоваровУслуг"), СтрокаТаблицыРаспределяемыхДокументов.СуммаРаспределяемая, -СтрокаТаблицыРаспределяемыхДокументов.СуммаРаспределяемая);			
		КонецЦикла;	
		
		Если СуммаВносимых > 0 Тогда	
		СуммаПлатежногоДокументаПосле = ОстатокПлатёжногоДокумента - СуммаВносимых;
		Элементы.НадписьОстатокПлатёжногоДокумента.Заголовок = "Сумма к списанию с ПД: " + СуммаВносимых;
		Элементы.СуммаПлатежногоДокументаПосле.Заголовок	 = "Остаток по ПД после проведения: " + СуммаПлатежногоДокументаПосле;
		
		Если ЗначениеЗаполнено(Объект.ПлатежныйДокумент) И СуммаВносимых > ОстатокПлатёжногоДокумента Тогда
			Элементы.НадписьОстатокПлатёжногоДокумента.Заголовок  = Элементы.НадписьОстатокПлатёжногоДокумента.Заголовок + ". Превышение остатка на " + (СуммаВносимых - ОстатокПлатёжногоДокумента) + "!";
			Элементы.НадписьОстатокПлатёжногоДокумента.ЦветТекста = WebЦвета.Красный;
		Иначе
			Элементы.НадписьОстатокПлатёжногоДокумента.ЦветТекста = WebЦвета.Черный;
		КонецЕсли;	
	Иначе	
		Элементы.НадписьОстатокПлатёжногоДокумента.Заголовок 	= "";
		Элементы.НадписьОстатокПлатёжногоДокумента.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;	
	Иначе
		Сообщить("Платёжный документ не выбран!");
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаРаспределяемыхДокументовСуммаРаспределяемаяПриИзменении(Элемент)
	
	ЗаполнитьИтогРТУ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВозвраты(Команда)
		
	ТаблицаВозвратовИзДополнительнойФормы = ОткрытьФормуМодально("Документ.РаспределениеПлатежей.Форма.ФормаДобавленияВозвратов", , ЭтаФорма);
	Если ЗначениеЗаполнено(ТаблицаВозвратовИзДополнительнойФормы) Тогда
		Для каждого СтрокаВозврата Из ТаблицаВозвратовИзДополнительнойФормы Цикл
			НоваяСтрокаСделок = Объект.ТаблицаРаспределяемыхДокументов.Добавить();
			НоваяСтрокаСделок.Сделка 				= СтрокаВозврата.ВозвратТоваровОтПокупателя;
			НоваяСтрокаСделок.СуммаОстаток 			= СтрокаВозврата.СуммаОстаткаПоРегистру;
			НоваяСтрокаСделок.СуммаРаспределяемая 	= СтрокаВозврата.СуммаОстаткаПоРегистру;
			НоваяСтрокаСделок.ВидДокумента 			= ТипЗнч(СтрокаВозврата.ВозвратТоваровОтПокупателя);
		КонецЦикла;	
	КонецЕсли;	

	ЗаполнитьИтогРТУ();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныйДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = Документы.ПоступлениеВБанк.ПолучитьФормуВыбора(,Элемент,);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ФормаВыбора.ДокументСписок.Отбор.Организация.Значение                            = Объект.Организация;
		ФормаВыбора.ДокументСписок.Отбор.Организация.Использование                       = Истина;
		ФормаВыбора.ДокументСписок.Отбор.Организация.ВидСравнения                        = ВидСравнения.Равно;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ФормаВыбора.ДокументСписок.Отбор.Контрагент.Значение                            = Объект.Контрагент;
		ФормаВыбора.ДокументСписок.Отбор.Контрагент.Использование                       = Истина;
		ФормаВыбора.ДокументСписок.Отбор.Контрагент.ВидСравнения                        = ВидСравнения.Равно;
	КонецЕсли;
			
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуТаблицыНаСервере(ВидДокументов)
	
	СтрокиПоОтбору = Объект.ТаблицаРаспределяемыхДокументов.НайтиСтроки(Новый Структура("ВидДокумента", ВидДокументов));
	
	СуммаРезультат = 0;
	Если СтрокиПоОтбору.Количество() > 0 Тогда
		Для каждого СтрокаПоОтбора Из СтрокиПоОтбору Цикл
			СуммаРезультат = СуммаРезультат + СтрокаПоОтбора.СуммаРаспределяемая;
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат СуммаРезультат;
	
КонецФункции	

&НаКлиенте
Процедура ТаблицаРаспределяемыхДокументовПриИзменении(Элемент)
	
	ЗаполнитьИтогРТУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныйДокументПриИзменении(Элемент)
	
	ЗаполнитьИтогРТУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаспределяемыхДокументовРаспределяемыйДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элемент.Родитель.ТекущиеДанные.ВидДокумента = ТипЗнч(ВыбранноеЗначение);
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ТипЗнч(ВыбранноеЗначение) <> Тип("Тип") Тогда
		СуммаОстаток = Документы.РаспределениеПлатежей.ПолучитьОстатокПлатёжногоДокумента(ВыбранноеЗначение, Новый Граница(ВыбранноеЗначение.МоментВремени(), ВидГраницы.Исключая), Объект.Ссылка);  //+++АК LAGP 2018.07.06 ИП-00019118.02 Проверяются остатки не включая движения документа
		Элемент.Родитель.ТекущиеДанные.СуммаОстаток = ?(СуммаОстаток < 0, -СуммаОстаток, СуммаОстаток);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаспределяемыхДокументовСуммаОстатокПриИзменении(Элемент)
	
	ЗаполнитьИтогРТУ();
	
КонецПроцедуры
